[
  "[File: networks/bitcoin/src/crypto.rs] [Function: Schnorr::verify_share()] [DoS - High] Can verify_share() be exploited to cause panics by providing a verification_share at the point at infinity or nonces that lead to point at infinity in the verification equation?",
  "[File: networks/bitcoin/src/crypto.rs] [Function: Schnorr::verify_share()] [Threshold Bypass - Critical] If verify_share() passes for fewer than threshold-t participants, can the aggregated signature still be considered valid, allowing unauthorized transactions with insufficient signature shares?",
  "[File: networks/bitcoin/src/crypto.rs] [Function: Schnorr::verify_share()] [Error Handling - High] The verify_share() function returns Result<Vec<(Scalar, ProjectivePoint)>, ()>. Does the empty () error provide enough information to distinguish between malicious vs. accidental verification failures for slashing purposes?",
  "[File: networks/bitcoin/src/crypto.rs] [Function: Schnorr::verify_share()] [Replay Attack - Medium] Can an attacker replay previously valid signature shares for a different signing session to bypass fresh share generation requirements?",
  "[File: networks/bitcoin/src/crypto.rs] [FROST Integration] [Key Generation - Critical] When threshold keys are generated for Bitcoin signing, does the system ensure that the group key is bound to the Bitcoin network context to prevent cross-chain signature replay attacks?",
  "[File: networks/bitcoin/src/crypto.rs] [FROST Integration] [Rogue Key Attack - Critical] Does the FROST implementation include proof-of-knowledge checks during DKG to prevent rogue-key attacks where malicious participants manipulate the aggregate public key?",
  "[File: networks/bitcoin/src/crypto.rs] [FROST Integration] [Preprocessing - High] Are FROST preprocessing nonces used exactly once and then securely erased, or can preprocessing reuse lead to key extraction from multiple signatures?",
  "[File: networks/bitcoin/src/crypto.rs] [FROST Integration] [Participant Set - Medium] Does the signing protocol verify that exactly the expected set of t participants are contributing shares, preventing a malicious subset from signing unauthorized transactions?",
  "[File: networks/bitcoin/src/crypto.rs] [BIP-340] [Tagged Hash - High] Does the const_hash computation of TAG_HASH at compile time ensure the correct BIP-340 tag is used, or can runtime modifications corrupt the tag and break cross-validation with Bitcoin nodes?",
  "[File: networks/bitcoin/src/crypto.rs] [BIP-340] [X-only Keys - High] When converting to x-only public keys, does the system properly track and validate that all validators use the same even/odd Y-coordinate convention to avoid signature incompatibility?",
  "[File: networks/bitcoin/src/crypto.rs] [BIP-340] [Challenge Binding - Critical] Is the BIP-340 challenge properly bound to the message, nonce, and public key to prevent Wagner's attack or other challenge manipulation attacks?",
  "[File: networks/bitcoin/src/crypto.rs] [BIP-340] [Signature Format - Medium] Does the 64-byte signature format (R_x || s) match Bitcoin's expectations exactly, or can byte ordering differences cause valid Serai signatures to be rejected by Bitcoin nodes?",
  "[File: networks/bitcoin/src/crypto.rs] [Side-Channel] [Conditional Selection - High] Are all conditional_select() operations truly constant-time at the assembly level, or can branch prediction or cache timing leak secret information during signature operations?",
  "[File: networks/bitcoin/src/crypto.rs] [Side-Channel] [Scalar Negation - Medium] When negating the challenge scalar c or signature s, does the negation operation execute in constant time to prevent timing attacks from revealing the negation choice?",
  "[File: networks/bitcoin/src/crypto.rs] [Side-Channel] [Point Encoding - Medium] Does the to_encoded_point() operation leak information about the point's Y-coordinate through timing or power analysis during encoding?",
  "[File: networks/bitcoin/src/crypto.rs] [Side-Channel] [CT Equality - Low] Is the ct_eq() comparison for Tag::CompressedOddY resistant to all known timing side-channels including cache-timing and speculative execution attacks?",
  "[File: networks/bitcoin/src/crypto.rs] [Error Handling] [Panic Safety - Critical] Since x(), x_only(), and verify() can panic on invalid inputs, if these functions are called in a consensus-critical path, can panics cause permanent chain halts or validator set failures?",
  "[File: networks/bitcoin/src/crypto.rs] [Error Handling] [Unwrap Safety - High] The unwrap() calls in verify() for signature conversion assume infallibility. Can an attacker craft FROST signatures that are the wrong length or format to trigger these unwraps and panic?",
  "[File: networks/bitcoin/src/crypto.rs] [Error Handling] [Expect Messages - Medium] Do the expect() error messages provide enough debugging context when panics occur, or will validators be unable to identify and slash malicious participants who trigger panics?",
  "[File: networks/bitcoin/src/crypto.rs] [Error Handling] [Result Propagation - High] Does the None return from verify() propagate properly to calling code with appropriate error handling, or can None be misinterpreted as a valid signature in some code paths?",
  "[File: networks/bitcoin/src/crypto.rs] [Arithmetic] [Scalar Reduction - Medium] Does Scalar::reduce() from U256 handle edge cases like all-zeros or all-ones inputs correctly without introducing bias in the challenge distribution?",
  "[File: networks/bitcoin/src/crypto.rs] [Arithmetic] [Negation Overflow - Low] When computing -c or -sum, does scalar negation handle the edge case of negating zero or the curve order correctly?",
  "[File: networks/bitcoin/src/crypto.rs] [Arithmetic] [U256 Conversion - Medium] Can the U256::from_be_slice() operation on SHA256 output fail or produce incorrect results if the hash output is malformed or truncated?",
  "[File: networks/bitcoin/src/crypto.rs] [Memory Safety] [Nonce Zeroization - High] Are the Zeroizing<Scalar> nonces properly zeroized after sign_share() completes, or can nonce values remain in memory and leak through side-channels or memory dumps?",
  "[File: networks/bitcoin/src/crypto.rs] [Memory Safety] [Key Material - Medium] Does the code ensure that private key material passed to sign_share() is never logged, printed, or exposed through debug formatting?"
]