[
  "[File: serai/crypto/frost/src/curve/mod.rs] [Trait: Curve::CONTEXT] [Cross-Chain Signature Forgery] **CRITICAL** Can an attacker exploit missing or weak CONTEXT values in concrete implementations to create signatures valid across different chains (Bitcoin, Ethereum, Monero), enabling cross-chain replay attacks and unauthorized fund transfers?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash()] [Domain Separation Bypass] **HIGH** Does the concatenation of CONTEXT, dst, and data in hash() allow for collision attacks if CONTEXT or dst lack fixed-length encoding, enabling an attacker to create ambiguous inputs that hash to the same value?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash()] [Malleability Attack] **HIGH** Can an attacker manipulate the boundary between CONTEXT, dst, and data parameters through carefully crafted inputs to produce the same hash output for different semantic meanings?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Trait: Curve::CONTEXT] [Network Confusion] **CRITICAL** If two different curve implementations use the same CONTEXT string, could validators accidentally sign messages for the wrong network, causing mint/burn imbalances between chains?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash()] [Memory Safety] **MEDIUM** Does the concat() operation in hash() allocate unbounded memory if dst or data are adversarially large, enabling DoS through memory exhaustion during DKG or signing ceremonies?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_to_F()] [Zero Field Element] **HIGH** Can hash_to_F() return zero field elements, and if so, would this break key generation or create weak nonces that leak secret shares during threshold signing?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_to_F()] [Domain Separation] **HIGH** Does the concatenation of CONTEXT and dst in hash_to_F() properly prevent collision between different uses (H1 vs H3), or can an attacker craft inputs causing the same field element for binding factors and nonces?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_to_F()] [Bias in Field Element] **MEDIUM** Does the underlying hash_to_F implementation from Ciphersuite introduce bias in the field element distribution that could weaken the DKG or enable statistical attacks on signatures?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_to_F()] [Side-Channel Timing] **MEDIUM** Is hash_to_F() constant-time, or could timing variations in field element reduction leak information about secrets when used in random_nonce() or hash_binding_factor()?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_msg()] [Message Collision] **HIGH** Can an attacker find two different messages that produce the same hash_msg() output, enabling them to obtain a signature on one message and claim it's for another, bypassing instruction validation?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_msg()] [Fixed DST] **MEDIUM** Is the hardcoded 'msg' domain separation tag sufficient to prevent collisions with other uses of the hash function, or could it overlap with custom protocol extensions?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_msg()] [Large Message DoS] **LOW** Does hash_msg() have any size limits on the message parameter, or could an attacker provide multi-gigabyte messages causing memory exhaustion or computation DoS?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_commitments()] [Commitment Malleability] **CRITICAL** If the commitments byte serialization is not canonical (e.g., allows identity point or non-reduced scalars), can an attacker create different commitment sets that hash to the same value, breaking binding factor uniqueness?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_commitments()] [Ordering Attack] **HIGH** Does hash_commitments() enforce a canonical ordering of participant commitments, or can different orderings produce the same hash, enabling signature malleability?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_commitments()] [Missing Commitment DoS] **MEDIUM** If some participants' commitments are missing or zero-length in the byte array, does hash_commitments() detect this, or could it produce a valid hash leading to invalid signature aggregation?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_binding_factor()] [Zero Binding Factor] **CRITICAL** The comment acknowledges hash_binding_factor() may return zero with negligible probability, but does this enable an attacker who finds a zero-hash collision to forge signatures by manipulating the binding equation in the FROST protocol?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_binding_factor()] [Preimage Attack] **HIGH** If an attacker can find a preimage for hash_binding_factor() that produces a chosen binding factor, can they manipulate the signature aggregation to cancel out honest participants' contributions?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_binding_factor()] [No Zero Check] **MEDIUM** Given that the code explicitly does not panic on zero binding factors (per IETF spec), could this negligible probability event occur in production and cause fund loss if not handled properly in higher-level signing code?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_binding_factor()] [Binding Input Malleability] **HIGH** Can an attacker manipulate the binding byte array input to produce the same binding factor for different sets of commitments and message, breaking the binding property?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: hash_binding_factor()] [rho DST] **MEDIUM** Is the 'rho' domain separation tag properly documented and does it match the IETF FROST specification exactly, or could implementation divergence cause cross-implementation signature incompatibility?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: random_nonce()] [Nonce Reuse Catastrophe] **CRITICAL** If the RNG provided to random_nonce() is weak or predictable, can an attacker predict future nonces and extract secret shares from partial signatures, leading to complete key compromise and fund theft?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: random_nonce()] [Seed Size] **HIGH** The seed is hardcoded to 32 bytes - is this sufficient entropy for all supported curves, or could curves with larger field sizes require more entropy, weakening the nonce unpredictability?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: random_nonce()] [Secret Leakage] **CRITICAL** Does the repr variable (secret.to_repr()) leave copies of the secret share in memory after zeroization, or could memory analysis recover the secret from unzeroed intermediate buffers?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: random_nonce()] [Rejection Sampling Loop] **HIGH** Could the rejection sampling loop fail to terminate if hash_to_F consistently produces zero (due to implementation bug or malicious hash function), causing a DoS hang during signing?",
  "[File: serai/crypto/frost/src/curve/mod.rs] [Function: random_nonce()] [Side-Channel Timing] **HIGH** Does the rejection sampling loop's variable iteration count leak information about the secret share through timing side-channels, allowing an attacker to narrow down secret values?"
]